1
defaultData = {
  "poketmon" : [],
  "spec" : [
    {"name" : "외로움을 타는"}
    ,{"name" : "고집스런"}
    ,{"name" : "개구쟁이같은"}
    ,{"name" : "용감함"}
    ,{"name" : "대담한"}
    ,{"name" : "장난꾸러기같은"}
    ,{"name" : "촐랑거리는"}
    ,{"name" : "무사태평한"}
    ,{"name" : "조심스러운"}
    ,{"name" : "의젓한"}
    ,{"name" : "덜렁거리는"}
    ,{"name" : "냉정한"}
    ,{"name" : "차분한"}
    ,{"name" : "얌전한"}
    ,{"name" : "신중한"}
    ,{"name" : "건방진"}
    ,{"name" : "겁쟁기같은"}
    ,{"name" : "성급한"}
    ,{"name" : "명량한"}
    ,{"name" : "천진난만한"}
    ,{"name" : "수줍음을 타는"}
    ,{"name" : "노력하는"}
    ,{"name" : "온순한"}
    ,{"name" : "변덕스러운"}
    ,{"name" : "성실한"},
  ],
  "local" : [
    {"name" : "하니평원 오솔길"}
    ,{"name" : "누림마을 과수원"}
    ,{"name" : "누림-북새 연결도로"}
    ,{"name" : "봄바람 들판"}
    ,{"name" : "북새마을 자연공원"}
    ,{"name" : "북새-자귀 연결도로"}
    ,{"name" : "서리산맥 산자락길"}
    ,{"name" : "서리산맥 동굴"}
    ,{"name" : "혜성시티 외곽 숲"}
    ,{"name" : "눈꽃 호수"}
    ,{"name" : "바람산맥 고개"}
    ,{"name" : "바람산맥 비탈길"}
    ,{"name" : "종단열차 개방 칸"}
    ,{"name" : "다라역"}
    ,{"name" : "종단열차 배틀카페"}
    ,{"name" : "황빛평야"}
    ,{"name" : "목새마을 고지대"}
    ,{"name" : "소소리 숲 초입"}
    ,{"name" : "소소리 숲 깊은 습지"}
    ,{"name" : "깍지산맥 기슭"}
    ,{"name" : "깍지산맥 등성이"}
    ,{"name" : "살비 푸른 들판"}
    ,{"name" : "키우미집 울타리 너머"}
    ,{"name" : "샛별마을 뒷골목길"}
    ,{"name" : "샛별 전력 발전소 인글"}
    ,{"name" : "샛별-둔치 연결도로"}
    ,{"name" : "둔치 항구"}
    ,{"name" : "둔치시티 플레이 에리어"}
    ,{"name" : "챔피언로드 초입 해변가"}
    ,{"name" : "챔피언로드 암반지대"}
    ,{"name" : "포켓몬 리그 뒷길"}
  ],
}
json = defaultData;